DataProcessors/КорректировкаСостоянияДатчиковИХолодильников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>КорректировкаСостоянияДатчиковИХолодильников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ИзмеряемыеПараметрыДатчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ИзмеряемыеПараметрыДатчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Температура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Влажность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Датчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Датчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СтруктурныеЕдиницы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыкладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаВыкладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзмеряемыйПараметр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИзмеряемыеПараметрыДатчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестоположениеДатчика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>is_made</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ShopNo</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id_mesto</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id_sensor</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Sensor_value</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Место</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>sensor_name</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Name_TT</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УтроВечер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месторасположение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>70</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/КорректировкаСостоянияДатчиковИХолодильников/Ext/ManagerModule.bsl
Функция ОбновитьМоделиИзSQL(ТаблицаМоделей) Экспорт
	
	НовыеМодели = Новый Массив;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаМоделей.id,
	                      |	ВЫРАЗИТЬ(ТаблицаМоделей.name КАК СТРОКА(100)) КАК name,
	                      |	ВЫРАЗИТЬ(ТаблицаМоделей.brand КАК СТРОКА(100)) КАК brand
	                      |ПОМЕСТИТЬ ВТ_Данные
	                      |ИЗ
	                      |	&ТаблицаМоделей КАК ТаблицаМоделей
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Данные.id,
	                      |	ВТ_Данные.name,
	                      |	ВТ_Данные.brand,
	                      |	МоделиХолодильников.Ссылка
	                      |ИЗ
	                      |	ВТ_Данные КАК ВТ_Данные
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МоделиХолодильников КАК МоделиХолодильников
	                      |		ПО ВТ_Данные.id = МоделиХолодильников.Код
	                      |ГДЕ
	                      |	(МоделиХолодильников.Ссылка ЕСТЬ NULL
	                      |			ИЛИ ВТ_Данные.name <> МоделиХолодильников.Наименование
	                      |			ИЛИ ВТ_Данные.brand <> МоделиХолодильников.Производитель)");
	
	Запрос.УстановитьПараметр("ТаблицаМоделей", ТаблицаМоделей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЭтоНоваяМодель = Ложь;
		
		Если Выборка.Ссылка = NULL Тогда
			МодельОбъект = Справочники.МоделиХолодильников.СоздатьЭлемент();
			МодельОбъект.Код = Выборка.id;
			ЭтоНоваяМодель = Истина;
		Иначе
			МодельОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли; 

		МодельОбъект.Наименование = СокрЛП(Выборка.name);
		МодельОбъект.Производитель = СокрЛП(Выборка.brand);
		
		Попытка 
			МодельОбъект.Записать();
			
			Если ЭтоНоваяМодель Тогда
				НовыеМодели.Добавить(МодельОбъект.Наименование);				
			КонецЕсли; 
			
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не удалось записать модель <%1> по причине: %2", МодельОбъект, ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки; 
	КонецЦикла;   
	
	Возврат НовыеМодели;
	
КонецФункции


Процедура ОбновитьДатчикиИзSQL(ТаблицаДатчиков) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаДатчиков.id,
	                      |	ВЫРАЗИТЬ(ТаблицаДатчиков.name КАК СТРОКА(100)) КАК name,
	                      |	ТаблицаДатчиков.type,
	                      |	ТаблицаДатчиков.notActive
	                      |ПОМЕСТИТЬ ВТ_Данные
	                      |ИЗ
	                      |	&ТаблицаДатчиков КАК ТаблицаДатчиков
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_Данные.id,
	                      |	ВТ_Данные.name,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Данные.type = 0
	                      |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИзмеряемыеПараметрыДатчиков.Температура)
	                      |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИзмеряемыеПараметрыДатчиков.Влажность)
	                      |	КОНЕЦ КАК ТипДатчика,
	                      |	ВЫБОР
	                      |		КОГДА ВТ_Данные.notActive = 0
	                      |			ТОГДА ЛОЖЬ
	                      |		ИНАЧЕ ИСТИНА
	                      |	КОНЕЦ КАК Неактивный,
	                      |	Датчики.Ссылка
	                      |ИЗ
	                      |	ВТ_Данные КАК ВТ_Данные
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Датчики КАК Датчики
	                      |		ПО ВТ_Данные.id = Датчики.ИД
	                      |ГДЕ
	                      |	(Датчики.Ссылка ЕСТЬ NULL
	                      |			ИЛИ ВТ_Данные.name <> Датчики.Наименование
	                      |			ИЛИ ВЫБОР
	                      |				КОГДА ВТ_Данные.notActive = 0
	                      |					ТОГДА ЛОЖЬ
	                      |				ИНАЧЕ ИСТИНА
	                      |			КОНЕЦ <> Датчики.ПометкаУдаления
	                      |			ИЛИ ВЫБОР
	                      |				КОГДА ВТ_Данные.type = 0
	                      |					ТОГДА ЗНАЧЕНИЕ(Перечисление.ИзмеряемыеПараметрыДатчиков.Температура)
	                      |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ИзмеряемыеПараметрыДатчиков.Влажность)
	                      |			КОНЕЦ <> Датчики.ИзмеряемыйПараметр)");
	
	Запрос.УстановитьПараметр("ТаблицаДатчиков", ТаблицаДатчиков);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СтруктурнаяЕдиница = Константы.ЦФОДляУчетаОсновныхСредств.Получить();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка = NULL Тогда
			ДатчикОбъект = Справочники.Датчики.СоздатьЭлемент();
			ДатчикОбъект.ИД = Выборка.id;
		Иначе
			ДатчикОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли; 

		ДатчикОбъект.Владелец = СтруктурнаяЕдиница;
		ДатчикОбъект.Наименование = СокрЛП(Выборка.name);
		ДатчикОбъект.ИзмеряемыйПараметр = Выборка.ТипДатчика;
		ДатчикОбъект.ПометкаУдаления = Выборка.Неактивный;		
		
		Попытка 
			ДатчикОбъект.Записать();
		Исключение
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не удалось записать датчик <%1> по причине: %2", ДатчикОбъект, ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
		КонецПопытки; 
	КонецЦикла;   
	
КонецПроцедуры
